Tekla Open API Reference for Tekla Structures 2025
TeklaStructuresSettings.SetOptions Method (ComponentOptions)
 Sets the component options.
 Namespace: Tekla.Structures
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static bool SetOptions(
	ComponentOptions Options
)
Public Shared Function SetOptions (
	Options As ComponentOptions
) As Boolean
Parameters
Options
Type: Tekla.Structures.ComponentOptions
The component options to be set.
Return Value
Type: Boolean
 True if the component options were successfully set.
Exceptions
Exception | Condition
ArgumentNullException | Options cannot be null
OverflowException | Folded Plate Profile Name is too long or Plate Profile Name is too long or Bolt Standard is too long or Bolt Size is too long or Part Material is too long or or or or
See Also
Reference
TeklaStructuresSettings Class
SetOptions Overload
Tekla.Structures Namespace